es/posts/a-py-scratch-sheet-on-the-fly/index.html
<!DOCTYPE html>
<html prefix="
" lang="es">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Binnacle · A Py Scratch Sheet On The Fly ~~` </title>
<link href="../../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=PT+Sans:400,400italic,700%7CAbril+Fatface">
<meta content="#5670d4" name="theme-color">
<link rel="alternate" type="application/rss+xml" title="RSS (en)" href="../../../rss.xml">
<link rel="alternate" type="application/rss+xml" title="RSS (es)" href="../../rss.xml">
<link rel="canonical" href="https://touxstone.github.io/binnacle.github.io/es/posts/a-py-scratch-sheet-on-the-fly/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Txe Llenne">
<link rel="prev" href="../matematicas-bayesianas-para-dummies/" title="Matemáticas Bayesianas Para Dummies" type="text/html">
<link rel="next" href="../7-de-julio-1932/" title="7 de Julio, 1932" type="text/html">
<link rel="alternate" hreflang="en" href="../../../posts/a-py-scratch-sheet-on-the-fly/">
</head>
<body class="">
    <a href="#content" class="sr-only sr-only-focusable">Ir al contenido principal</a>

    <div class="hsidebar">
        <div class="container sidebar-sticky">
            <div class="sidebar-about">
              <h1>
                <a href="https://touxstone.github.io/binnacle.github.io/es/">
                      <h1 id="brand"><a href="https://touxstone.github.io/binnacle.github.io/es/" title="Binnacle" rel="home">

        <span id="blog-title">Binnacle</span>
    </a></h1>

                </a>
              </h1>
                <p class="lead">Hey, here my (public) binnacle point.</p>

            </div>
                <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../archive.html">Archivo</a>
        <a class="sidebar-nav-item" href="../../categories/">Etiquetas</a>
        <a class="sidebar-nav-item" href="../../rss.xml">Canal RSS</a>
    
    
    </nav><footer id="footer"><span class="copyright">
              Contents © 2022         <a href="mailto:psicotherapy@gmail.com">Txe Llenne</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            </span>
            
            
        </footer>
</div>
    </div>

    <div class="content container" id="content">
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><h1 class="post-title p-name"><a href="." class="u-url">A Py Scratch Sheet On The Fly ~~`</a></h1>

    <span class="post-date">
      <time class="published dt-published" datetime="2021-02-17T18:54:14Z" itemprop="datePublished" title="2021-02-17 18:54">2021-02-17 18:54</time></span>

    
    

    <div class="e-content entry-content" itemprop="articleBody text">
    <p>
Hi, People.
Os presento aquí una ventana de ayuda y probar al vuelo trocetes de código (python). Útil si requerís verificar algo (corto y) rápido, un manual que estéis leyendo, por ejemplo, y os pilla en el trayecto del metro o, en fin, fuera del entorno habitual de estudio o trabajo y/o no podéis esperar. —Hey, que a veces pasa…
</p>

<!-- TEASER_END -->


  
  <meta charset="utf-8">
<link rel="stylesheet" type="text/css" href="https://storage.googleapis.com/app.klipse.tech/css/codemirror.css">
<script>
       window.klipse_settings = {
         selector_eval_python_client: '.language-klipse-python'
       };
      </script><div>
       <p>Por cierto, powered by <strong>klipsify</strong> es interactiva, probad!</p>
        <p>And now, we are going to <strong>klipsify</strong> this code snippet:</p>

        <pre><code class="language-klipse-python">
def foo():
    print("Hello World!")

foo()
        </code></pre>
    </div>
    <script src="https://storage.googleapis.com/app.klipse.tech/plugin_prod/js/klipse_plugin.min.js?v=7.3.4"></script><div id="outline-container-orgbb1e6ec" class="outline-2">
<h2 id="orgbb1e6ec">Edit. date ;; Wed 21 Sep 19:42:50 BST 2022</h2>
<div class="outline-text-2" id="text-orgbb1e6ec">
<p>
I should say that the above python scratch page has a handicap as it cannot run properly on mobile browsers, but the fact is that this try dates back to a time when PyScript did not exist, yet. Let's try the same plan with this other approach this time, using <a href="https://pyscript.net/">PyScript</a>.
</p>



    
    <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>REPL</title>
<link rel="icon" type="image/png" href="favicon.png">
<link rel="stylesheet" href="https://pyscript.net/alpha/pyscript_base.css">
<script defer src="https://pyscript.net/alpha/pyscript.js"></script><py-env>
      - numpy
    </py-env><div id="output" class="text-3xl"></div>
      <!-- <py-script>
        
      </py-script> -->
      <py-repl></py-repl>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><div class="pager hidden-print pagination">

            <span class="previous pagination-item older">
                <a href="../matematicas-bayesianas-para-dummies/" rel="prev" title="Matemáticas Bayesianas Para Dummies">
                Publicación anterior
                </a>
            </span>


            <span class="next pagination-item newer">
                <a href="../7-de-julio-1932/" rel="next" title="7 de Julio, 1932">
Siguiente publicación
              </a>
            </span>

        </div>

    </nav></aside></article>
</div>
            <script src="../../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
